RT-Thread/rt-thread/bsp/wch/risc-v/Libraries/CH32V10x_StdPeriph_Driver/StdPeriph_Driver/inc/ch32v10x_usb.h
typedef struct __PACKED _USB_CONFIG_DESCR
{
    UINT8  bLength;
    UINT8  bDescriptorType;
    UINT16 wTotalLength;
    UINT8  bNumInterfaces;
    UINT8  bConfigurationValue;
    UINT8  iConfiguration;
    UINT8  bmAttributes;
    UINT8  MaxPower;
} USB_CFG_DESCR, *PUSB_CFG_DESCR;

typedef struct __PACKED _USB_INTERF_DESCR
{
    UINT8 bLength;
    UINT8 bDescriptorType;
    UINT8 bInterfaceNumber;
    UINT8 bAlternateSetting;
    UINT8 bNumEndpoints;
    UINT8 bInterfaceClass;
    UINT8 bInterfaceSubClass;
    UINT8 bInterfaceProtocol;
    UINT8 iInterface;
} USB_ITF_DESCR, *PUSB_ITF_DESCR;

typedef struct __PACKED _USB_ENDPOINT_DESCR
{
    UINT8  bLength;
    UINT8  bDescriptorType;
    UINT8  bEndpointAddress;
    UINT8  bmAttributes;
    UINT16 wMaxPacketSize;
    UINT8  bInterval;
} USB_ENDP_DESCR, *PUSB_ENDP_DESCR;

typedef struct __PACKED _USB_CONFIG_DESCR_LONG
{
    USB_CFG_DESCR  cfg_descr;
    USB_ITF_DESCR  itf_descr;
    USB_ENDP_DESCR endp_descr[1];
} USB_CFG_DESCR_LONG, *PUSB_CFG_DESCR_LONG;

typedef struct __PACKED _USB_HUB_DESCR
{
    UINT8 bDescLength;
    UINT8 bDescriptorType;
    UINT8 bNbrPorts;
    UINT8 wHubCharacteristicsL;
    UINT8 wHubCharacteristicsH;
    UINT8 bPwrOn2PwrGood;
    UINT8 bHubContrCurrent;
    UINT8 DeviceRemovable;
    UINT8 PortPwrCtrlMask;
} USB_HUB_DESCR, *PUSB_HUB_DESCR;

typedef struct __PACKED _USB_HID_DESCR
{
    UINT8  bLength;
    UINT8  bDescriptorType;
    UINT16 bcdHID;
    UINT8  bCountryCode;
    UINT8  bNumDescriptors;
    UINT8  bDescriptorTypeX;
    UINT8  wDescriptorLengthL;
    UINT8  wDescriptorLengthH;
} USB_HID_DESCR, *PUSB_HID_DESCR;

typedef struct __PACKED _UDISK_BOC_CBW
{ /* command of BulkOnly USB-FlashDisk */
    UINT32 mCBW_Sig;
    UINT32 mCBW_Tag;
    UINT32 mCBW_DataLen; /* uppest byte of data length, always is 0 */
    UINT8  mCBW_Flag;    /* transfer direction and etc. */
    UINT8  mCBW_LUN;
    UINT8  mCBW_CB_Len;     /* length of command block */
    UINT8  mCBW_CB_Buf[16]; /* command block buffer */
} UDISK_BOC_CBW, *PXUDISK_BOC_CBW;

typedef struct __PACKED _UDISK_BOC_CSW
{ /* status of BulkOnly USB-FlashDisk */
    UINT32 mCBW_Sig;
    UINT32 mCBW_Tag;
    UINT32 mCSW_Residue; /* return: remainder bytes */ /* uppest byte of remainder length, always is 0 */
    UINT8  mCSW_Status;                                /* return: result status */
} UDISK_BOC_CSW, *PXUDISK_BOC_CSW;

extern PUINT8 pEP0_RAM_Addr; //ep0(64)
extern PUINT8 pEP1_RAM_Addr; //ep1_out(64)+ep1_in(64)
extern PUINT8 pEP2_RAM_Addr; //ep2_out(64)+ep2_in(64)
extern PUINT8 pEP3_RAM_Addr; //ep3_out(64)+ep3_in(64)
extern PUINT8 pEP4_RAM_Addr; //ep4_out(64)+ep4_in(64)
extern PUINT8 pEP5_RAM_Addr; //ep5_out(64)+ep5_in(64)
extern PUINT8 pEP6_RAM_Addr; //ep6_out(64)+ep6_in(64)
extern PUINT8 pEP7_RAM_Addr; //ep7_out(64)+ep7_in(64)

#define pSetupReqPak        ((PUSB_SETUP_REQ)pEP0_RAM_Addr)
#define pEP0_DataBuf        (pEP0_RAM_Addr)
#define pEP1_OUT_DataBuf    (pEP1_RAM_Addr)
#define pEP1_IN_DataBuf     (pEP1_RAM_Addr + 64)
#define pEP2_OUT_DataBuf    (pEP2_RAM_Addr)
#define pEP2_IN_DataBuf     (pEP2_RAM_Addr + 64)
#define pEP3_OUT_DataBuf    (pEP3_RAM_Addr)
#define pEP3_IN_DataBuf     (pEP3_RAM_Addr + 64)
#define pEP4_OUT_DataBuf    (pEP4_RAM_Addr)
#define pEP4_IN_DataBuf     (pEP4_RAM_Addr + 64)
#define pEP5_OUT_DataBuf    (pEP5_RAM_Addr)
#define pEP5_IN_DataBuf     (pEP5_RAM_Addr + 64)
#define pEP6_OUT_DataBuf    (pEP6_RAM_Addr)
#define pEP6_IN_DataBuf     (pEP6_RAM_Addr + 64)
#define pEP7_OUT_DataBuf    (pEP7_RAM_Addr)
#define pEP7_IN_DataBuf     (pEP7_RAM_Addr + 64)

void USB_DeviceInit(void);
void USB_DevTransProcess(void);

void DevEP1_OUT_Deal(UINT8 l);
void DevEP2_OUT_Deal(UINT8 l);
void DevEP3_OUT_Deal(UINT8 l);
void DevEP4_OUT_Deal(UINT8 l);
void DevEP5_OUT_Deal(UINT8 l);
void DevEP6_OUT_Deal(UINT8 l);
void DevEP7_OUT_Deal(UINT8 l);

void DevEP1_IN_Deal(UINT8 l);
void DevEP2_IN_Deal(UINT8 l);
void DevEP3_IN_Deal(UINT8 l);
void DevEP4_IN_Deal(UINT8 l);
void DevEP5_IN_Deal(UINT8 l);
void DevEP6_IN_Deal(UINT8 l);
void DevEP7_IN_Deal(UINT8 l);

#define EP1_GetINSta()    (R8_UEP1_CTRL & UEP_T_RES_NAK)
#define EP2_GetINSta()    (R8_UEP2_CTRL & UEP_T_RES_NAK)
#define EP3_GetINSta()    (R8_UEP3_CTRL & UEP_T_RES_NAK)
#define EP4_GetINSta()    (R8_UEP4_CTRL & UEP_T_RES_NAK)
#define EP5_GetINSta()    (R8_UEP5_CTRL & UEP_T_RES_NAK)
#define EP6_GetINSta()    (R8_UEP6_CTRL & UEP_T_RES_NAK)
#define EP7_GetINSta()    (R8_UEP7_CTRL & UEP_T_RES_NAK)

#ifdef __cplusplus
}
#endif

#endif // __USB_TYPE__
